import {
  type WeightedItem,
  WeightedItemFeeder,
} from "../../../common/weightedItemFeeder.js";
import type { StaticCommand } from "../../type.js";

export const hyakuninIsshu: StaticCommand = {
  name: "hyakuninIsshu",
  run: () => {
    const tankaWithAuthor = hyakuninIsshuFeeder.getItem();
    if (tankaWithAuthor === undefined) {
      return "NO_DATA";
    }
    return tankaWithAuthorToString(tankaWithAuthor);
  },
};

function tankaWithAuthorToString(tankaWithAuthor: TankaWithAuthor): string {
  const { uta, author } = tankaWithAuthor;
  const [up1, up2, up3, down1, down2] = uta;
  return `${up1} ${up2} ${up3}
${down1} ${down2}
${author}`;
}

type Tanka = [string, string, string, string, string];

interface TankaWithAuthor {
  readonly uta: Tanka;
  readonly author: string;
}

const data: WeightedItem<TankaWithAuthor>[] = [
  {
    content: {
      uta: [
        "秋の田の",
        "かりほの庵の",
        "苫をあらみ",
        "わが衣手は",
        "露にぬれつつ",
      ],
      author: "天智天皇",
    },
  },
  {
    content: {
      uta: ["春過ぎて", "夏来にけらし", "白妙の", "衣ほすてふ", "天の香具山"],
      author: "持統天皇",
    },
  },
  {
    content: {
      uta: [
        "足引きの",
        "山鳥の尾の",
        "しだり尾の",
        "ながながし",
        "夜をひとりかもねむ",
      ],
      author: "柿本人麿",
    },
  },
  {
    content: {
      uta: [
        "田子の浦に",
        "打出でてみれば",
        "白妙の",
        "ふじの高嶺に",
        "雪は降りつつ",
      ],
      author: "山部赤人",
    },
  },
  {
    content: {
      uta: ["奥山に", "紅葉ふみ分け", "なく鹿の", "聲きく時ぞ", "秋は悲しき"],
      author: "猿丸大夫",
    },
  },
  {
    content: {
      uta: [
        "かさゝぎの",
        "渡せる橋に",
        "おく霜の",
        "しろきを見れば",
        "夜ぞふけにける",
      ],
      author: "中納言家持",
    },
  },
  {
    content: {
      uta: [
        "天の原",
        "ふりさけ見れば",
        "春日なる",
        "みかさの山に",
        "出でし月かも",
      ],
      author: "安部仲麻呂",
    },
  },
  {
    content: {
      uta: [
        "わが庵は",
        "都のたつみ",
        "しかぞ住む",
        "世をうぢ山と",
        "人はいふなり",
      ],
      author: "喜撰法師",
    },
  },
  {
    content: {
      uta: [
        "花の色は",
        "移りにけりな",
        "徒に",
        "我が身世にふる",
        "ながめせしまに",
      ],
      author: "小野小町",
    },
  },
  {
    content: {
      uta: [
        "これや此の",
        "行くも帰るも",
        "別かれては",
        "知るも知らぬも",
        "逢坂の関",
      ],
      author: "蝉丸",
    },
  },
  {
    content: {
      uta: [
        "わたの原",
        "八十島かけて",
        "漕ぎ出でぬと",
        "人にはつげよ",
        "あまの釣り舟",
      ],
      author: "参議篁",
    },
  },
  {
    content: {
      uta: [
        "天つ風",
        "雲のかよひぢ",
        "吹きとぢよ",
        "をとめの姿",
        "しばし留めむ",
      ],
      author: "僧正遍昭",
    },
  },
  {
    content: {
      uta: [
        "筑波嶺の",
        "峯より落つる",
        "みなの川",
        "戀ぞつもりて",
        "淵となりぬる",
      ],
      author: "陽成院",
    },
  },
  {
    content: {
      uta: [
        "陸奥の",
        "しのぶもぢずり",
        "誰故に",
        "みだれ初めにし",
        "我ならなくに",
      ],
      author: "河原左大臣",
    },
  },
  {
    content: {
      uta: [
        "君がため",
        "春の野に出でて",
        "若菜つむ",
        "わが衣手に",
        "雪は降りつつ",
      ],
      author: "光孝天皇",
    },
  },
  {
    content: {
      uta: [
        "立別れ",
        "いなばの山の",
        "嶺におふる",
        "まつとし聞かば",
        "今帰り来む",
      ],
      author: "中納言行平",
    },
  },
  {
    content: {
      uta: ["ちはやぶる", "神代も聞かず", "龍田川", "から紅に", "水くくるとは"],
      author: "在原業平朝臣",
    },
  },
  {
    content: {
      uta: [
        "住の江の",
        "岸に寄る浪",
        "よるさへや",
        "夢の通ひ路",
        "人目よくらむ",
      ],
      author: "藤原敏行朝臣",
    },
  },
  {
    content: {
      uta: [
        "難波潟",
        "短き葦の",
        "ふしのまも",
        "あはで此の世を",
        "すぐしてよとや",
      ],
      author: "伊勢",
    },
  },
  {
    content: {
      uta: [
        "侘びぬれば",
        "今はた同じ",
        "難波なる",
        "身をつくしても",
        "逢はむとぞ思ふ",
      ],
      author: "元良親王",
    },
  },
  {
    content: {
      uta: [
        "今来むと",
        "いひしばかりに",
        "長月の",
        "有明の月を",
        "待ち出でつるかな",
      ],
      author: "素性法師",
    },
  },
  {
    content: {
      uta: [
        "吹くからに",
        "秋の草木の",
        "しをるれば",
        "むべ山風を",
        "あらしといふらむ",
      ],
      author: "文屋康秀",
    },
  },
  {
    content: {
      uta: [
        "月見れば",
        "千々に物こそ",
        "悲しけれ",
        "わが身ひとつの",
        "秋にはあらねど",
      ],
      author: "大江千里",
    },
  },
  {
    content: {
      uta: ["此の度は", "幣もとりあへず", "手向山", "紅葉の錦", "神のまにまに"],
      author: "菅家",
    },
  },
  {
    content: {
      uta: [
        "名にしおはば",
        "逢坂山の",
        "さねかづら",
        "人にしられで",
        "くるよしもがな",
      ],
      author: "三条右大臣",
    },
  },
  {
    content: {
      uta: [
        "小倉山",
        "峯のもみぢ葉",
        "心あらば",
        "今ひとたびの",
        "みゆき待たなむ",
      ],
      author: "貞信公",
    },
  },
  {
    content: {
      uta: [
        "みかの原",
        "わきて流るる",
        "泉川",
        "いつみきとてか",
        "戀しかるらむ",
      ],
      author: "中納言兼輔",
    },
  },
  {
    content: {
      uta: [
        "山里は",
        "冬ぞ寂しさ",
        "まさりける",
        "人目も草も",
        "かれぬと思へば",
      ],
      author: "源宗于朝臣",
    },
  },
  {
    content: {
      uta: [
        "心あてに",
        "折らばや折らむ",
        "初霜の",
        "置きまどはせる",
        "白菊の花",
      ],
      author: "凡河内躬恒",
    },
  },
  {
    content: {
      uta: [
        "有明の",
        "つれなく見えし",
        "別れより",
        "暁ばかり",
        "憂きものはなし",
      ],
      author: "壬生忠岑",
    },
  },
  {
    content: {
      uta: ["朝ぼらけ", "有明の月と", "見るまでに", "吉野の里に", "降れる白雪"],
      author: "坂上是則",
    },
  },
  {
    content: {
      uta: [
        "山がはに",
        "風のかけたる",
        "しがらみは",
        "流れもあへぬ",
        "紅葉なりけり",
      ],
      author: "春道列樹",
    },
  },
  {
    content: {
      uta: [
        "久方の",
        "光のどけき",
        "春の日に",
        "しづごころなく",
        "花の散るらむ",
      ],
      author: "紀友則",
    },
  },
  {
    content: {
      uta: ["誰をかも", "知る人にせむ", "高砂の", "松も昔の", "友ならなくに"],
      author: "藤原興風",
    },
  },
  {
    content: {
      uta: [
        "人はいさ",
        "心もしらず",
        "ふるさとは",
        "花ぞ昔の",
        "香ににほひける",
      ],
      author: "紀貫之",
    },
  },
  {
    content: {
      uta: [
        "夏の夜は",
        "まだ宵ながら",
        "あけぬるを",
        "雲のいづこに",
        "月宿るらむ",
      ],
      author: "清原深養父",
    },
  },
  {
    content: {
      uta: [
        "白露に",
        "風の吹きしく",
        "秋の野は",
        "つらぬきとめぬ",
        "玉ぞ散りける",
      ],
      author: "文屋朝康",
    },
  },
  {
    content: {
      uta: [
        "忘らるる",
        "身をば思はず",
        "誓ひてし",
        "人の命の",
        "惜しくもあるかな",
      ],
      author: "右近",
    },
  },
  {
    content: {
      uta: [
        "浅茅生の",
        "小野の篠原",
        "しのぶれど",
        "あまりてなどか",
        "人の戀しき",
      ],
      author: "参議等",
    },
  },
  {
    content: {
      uta: [
        "忍れど",
        "色に出でにけり",
        "我が戀は",
        "ものや思ふと",
        "人の問ふまで",
      ],
      author: "平兼盛",
    },
  },
  {
    content: {
      uta: [
        "戀すてふ",
        "わが名はまだき",
        "立ちにけり",
        "人知れずこそ",
        "思ひそめしか",
      ],
      author: "壬生忠見",
    },
  },
  {
    content: {
      uta: [
        "契りきな",
        "かたみに袖を",
        "しぼりつつ",
        "末の松山",
        "浪こさじとは",
      ],
      author: "清原元輔",
    },
  },
  {
    content: {
      uta: [
        "逢ひみての",
        "後の心に",
        "くらぶれば",
        "昔はものを",
        "思はざりけり",
      ],
      author: "権中納言敦忠",
    },
  },
  {
    content: {
      uta: [
        "逢ふことの",
        "絶えてしなくば",
        "なかなかに",
        "人をも身をも",
        "恨みざらまし",
      ],
      author: "中納言朝忠",
    },
  },
  {
    content: {
      uta: [
        "哀れとも",
        "いふべき人は",
        "おもほえで",
        "身のいたづらに",
        "なりぬべきかな",
      ],
      author: "謙徳公",
    },
  },
  {
    content: {
      uta: [
        "由良の戸を",
        "わたる舟人",
        "楫をたえ",
        "行方もしらぬ",
        "戀の道かな",
      ],
      author: "曽祢好忠",
    },
  },
  {
    content: {
      uta: [
        "八重葎",
        "しげれる宿の",
        "さびしきに",
        "人こそ見えね",
        "秋はきにけり",
      ],
      author: "恵慶法師",
    },
  },
  {
    content: {
      uta: [
        "風をいたみ",
        "岩うつ浪の",
        "おのれのみ",
        "砕けてものを",
        "思ふ頃かな",
      ],
      author: "源重之",
    },
  },
  {
    content: {
      uta: [
        "御垣守",
        "衛士のたく火の",
        "夜はもえ",
        "晝は消えつつ",
        "ものをこそ思へ",
      ],
      author: "大中臣能宣朝臣",
    },
  },
  {
    content: {
      uta: [
        "君がため",
        "惜しからざりし",
        "命さへ",
        "長くもがなと",
        "思ひけるかな",
      ],
      author: "藤原義孝",
    },
  },
  {
    content: {
      uta: [
        "かくとだに",
        "えやはいぶきの",
        "さしも草",
        "さしも知らじな",
        "もゆる思ひを",
      ],
      author: "藤原実方朝臣",
    },
  },
  {
    content: {
      uta: [
        "明けぬれば",
        "くるるものとは",
        "知りながら",
        "なほ恨めしき",
        "朝ぼらけかな",
      ],
      author: "藤原道信朝臣",
    },
  },
  {
    content: {
      uta: [
        "嘆きつつ",
        "独りぬる夜の",
        "明くるまは",
        "いかに久しき",
        "ものとかは知る",
      ],
      author: "右大将道綱母",
    },
  },
  {
    content: {
      uta: ["忘れじの", "行末までは", "難ければ", "今日を限りの", "命ともがな"],
      author: "儀同三司母",
    },
  },
  {
    content: {
      uta: [
        "瀧の音は",
        "たえて久しく",
        "なりぬれど",
        "名こそ流れて",
        "なほ聞こえけれ",
      ],
      author: "大納言公任",
    },
  },
  {
    content: {
      uta: [
        "あらざらむ",
        "此の世のほかの",
        "思ひ出に",
        "今一たびの",
        "逢ふこともがな",
      ],
      author: "和泉式部",
    },
  },
  {
    content: {
      uta: [
        "廻り逢ひて",
        "見しやそれとも",
        "わかぬまに",
        "雲がくれにし",
        "夜半の月かな",
      ],
      author: "紫式部",
    },
  },
  {
    content: {
      uta: [
        "有馬山",
        "ゐなのささ原",
        "風吹けば",
        "いでそよ人を",
        "忘れやはする",
      ],
      author: "大貮三位",
    },
  },
  {
    content: {
      uta: [
        "やすらはで",
        "寝なましものを",
        "小夜更けて",
        "傾くまでの",
        "月を見しかな",
      ],
      author: "赤染衛門",
    },
  },
  {
    content: {
      uta: ["大江山", "いくのの道の", "遠ければ", "まだふみも見ず", "天の橋立"],
      author: "小式部内侍",
    },
  },
  {
    content: {
      uta: ["古への", "奈良の都の", "八重ざくら", "今日九重に", "匂ひぬるかな"],
      author: "伊勢大輔",
    },
  },
  {
    content: {
      uta: [
        "夜をこめて",
        "鳥のそら音は",
        "はかるとも",
        "世に逢坂の",
        "関はゆるさじ",
      ],
      author: "清少納言",
    },
  },
  {
    content: {
      uta: [
        "今はただ",
        "思ひ絶えなむ",
        "とばかりを",
        "人づてならで",
        "言ふよしもがな",
      ],
      author: "左京大夫道雅",
    },
  },
  {
    content: {
      uta: [
        "朝ぼらけ",
        "宇治の川霧",
        "絶えだえに",
        "あらはれ渡る",
        "瀬々の網代木",
      ],
      author: "権中納言定頼",
    },
  },
  {
    content: {
      uta: [
        "恨み侘び",
        "ほさぬ袖だに",
        "あるものを",
        "戀に朽ちなむ",
        "名こそ惜しけれ",
      ],
      author: "相模",
    },
  },
  {
    content: {
      uta: [
        "諸共に",
        "あはれと思へ",
        "山ざくら",
        "花よりほかに",
        "知る人もなし",
      ],
      author: "大僧正行尊",
    },
  },
  {
    content: {
      uta: [
        "春の夜の",
        "夢ばかりなる",
        "手枕に",
        "かひなく立たむ",
        "名こそ惜しけれ",
      ],
      author: "周防内侍",
    },
  },
  {
    content: {
      uta: [
        "心にも",
        "あらで憂世に",
        "ながらへば",
        "戀しかるべき",
        "夜半の月かな",
      ],
      author: "三條院",
    },
  },
  {
    content: {
      uta: ["嵐ふく", "三室の山の", "もみぢ葉は", "龍田の川の", "錦なりけり"],
      author: "能因法師",
    },
  },
  {
    content: {
      uta: [
        "寂しさに",
        "宿を立ち出でて",
        "眺むれば",
        "いづこも同じ",
        "秋の夕暮",
      ],
      author: "良暹法師",
    },
  },
  {
    content: {
      uta: [
        "夕されば",
        "門田の稲葉",
        "おとづれて",
        "あしのまろやに",
        "秋風ぞ吹く",
      ],
      author: "大納言経信",
    },
  },
  {
    content: {
      uta: [
        "音に聞く",
        "高師の濱の",
        "あだ浪は",
        "かけじや袖の",
        "ぬれもこそすれ",
      ],
      author: "祐子内親王家紀伊",
    },
  },
  {
    content: {
      uta: [
        "高砂の",
        "尾の上の桜",
        "咲きにけり",
        "外山の霞",
        "立たずもあらなむ",
      ],
      author: "権中納言匡房",
    },
  },
  {
    content: {
      uta: [
        "うかりける",
        "人を初瀬の",
        "山おろし",
        "はげしかれとは",
        "祈らぬものを",
      ],
      author: "源俊頼朝臣",
    },
  },
  {
    content: {
      uta: [
        "契りおきし",
        "させもが露を",
        "命にて",
        "あはれ今年の",
        "秋も去ぬめり",
      ],
      author: "藤原基俊",
    },
  },
  {
    content: {
      uta: [
        "わたの原",
        "漕ぎ出でて見れば",
        "久方の",
        "雲居にまがふ",
        "沖つ白浪",
      ],
      author: "法性寺入道前関白太政大臣",
    },
  },
  {
    content: {
      uta: [
        "瀬を早み",
        "岩にせかるる",
        "瀧川の",
        "われても末に",
        "逢はむとぞ思ふ",
      ],
      author: "崇徳院",
    },
  },
  {
    content: {
      uta: [
        "淡路島",
        "かよふ千鳥の",
        "鳴く声に",
        "いくよ寝覚めぬ",
        "須磨の関守",
      ],
      author: "源兼昌",
    },
  },
  {
    content: {
      uta: [
        "秋風に",
        "たなびく雲の",
        "絶え間より",
        "もれ出づる月の",
        "影のさやけさ",
      ],
      author: "左京大夫顕輔",
    },
  },
  {
    content: {
      uta: [
        "ながからむ",
        "心も知らず",
        "黒髪の",
        "みだれて今朝は",
        "ものをこそ思へ",
      ],
      author: "待賢門院堀川",
    },
  },
  {
    content: {
      uta: [
        "ほととぎす",
        "鳴きつる方を",
        "眺むれば",
        "ただ有明の",
        "月ぞ残れる",
      ],
      author: "後徳大寺左大臣",
    },
  },
  {
    content: {
      uta: [
        "思ひわび",
        "さても命は",
        "あるものを",
        "憂きに堪へぬは",
        "涙なりけり",
      ],
      author: "道因法師",
    },
  },
  {
    content: {
      uta: [
        "世の中よ",
        "道こそなけれ",
        "思ひ入る",
        "山の奥にも",
        "鹿ぞなくなる",
      ],
      author: "皇太后宮大夫俊成",
    },
  },
  {
    content: {
      uta: [
        "ながらへば",
        "また此の頃や",
        "しのばれむ",
        "憂しと見し世ぞ",
        "今は戀しき",
      ],
      author: "藤原清輔朝臣",
    },
  },
  {
    content: {
      uta: [
        "夜もすがら",
        "もの思ふ頃は",
        "明けやらで",
        "ねやのひまさへ",
        "つれなかりけり",
      ],
      author: "俊恵法師",
    },
  },
  {
    content: {
      uta: [
        "嘆けとて",
        "月やはものを",
        "思はする",
        "かこち顔なる",
        "わが涙かな",
      ],
      author: "西行法師",
    },
  },
  {
    content: {
      uta: ["村雨の", "露もまだひぬ", "槇の葉に", "霧立ちのぼる", "秋の夕暮"],
      author: "寂蓮法師",
    },
  },
  {
    content: {
      uta: [
        "難波江の",
        "あしのかりねの",
        "一夜ゆゑ",
        "みをつくしてや",
        "戀ひわたるべき",
      ],
      author: "皇嘉門院別当",
    },
  },
  {
    content: {
      uta: [
        "玉の緒よ",
        "たえなば絶えね",
        "ながらへば",
        "忍ぶることの",
        "弱りもぞする",
      ],
      author: "式子内親王",
    },
  },
  {
    content: {
      uta: [
        "見せばやな",
        "雄島のあまの",
        "袖だにも",
        "濡れにぞ濡れし",
        "色はかはらず",
      ],
      author: "殷富門院大輔",
    },
  },
  {
    content: {
      uta: [
        "きりぎりす",
        "なくや霜夜の",
        "さむしろに",
        "衣かたしき",
        "獨りかも寝む",
      ],
      author: "後京極摂政前太政大臣",
    },
  },
  {
    content: {
      uta: [
        "わが袖は",
        "汐干に見えぬ",
        "沖の石の",
        "人こそ知らね",
        "乾く間もなし",
      ],
      author: "二条院讃岐",
    },
  },
  {
    content: {
      uta: [
        "世の中は",
        "常にもがもな",
        "渚こぐ",
        "海士の小舟の",
        "綱手かなしも",
      ],
      author: "鎌倉右大臣",
    },
  },
  {
    content: {
      uta: ["みよしのの", "山の秋風", "小夜更けて", "故郷寒く", "衣うつなり"],
      author: "参議雅経",
    },
  },
  {
    content: {
      uta: [
        "おほけなく",
        "うき世の民に",
        "おほふかな",
        "我が立つ杣に",
        "墨染の袖",
      ],
      author: "前大僧正慈圓",
    },
  },
  {
    content: {
      uta: [
        "花さそふ",
        "あらしの庭の",
        "雪ならで",
        "ふりゆくものは",
        "我が身なりけり",
      ],
      author: "入道前太政大臣",
    },
  },
  {
    content: {
      uta: [
        "来ぬ人を",
        "松帆の浦の",
        "夕なぎに",
        "焼くや藻塩の",
        "身もこがれつつ",
      ],
      author: "権中納言定家",
    },
  },
  {
    content: {
      uta: [
        "風そよぐ",
        "楢の小川の",
        "夕ぐれは",
        "みそぎぞ夏の",
        "しるしなりける",
      ],
      author: "従二位家隆",
    },
  },
  {
    content: {
      uta: [
        "人もをし",
        "人もうらめし",
        "あぢきなく",
        "世を思ふ故に",
        "もの思ふ身は",
      ],
      author: "後鳥羽院",
    },
  },
  {
    content: {
      uta: [
        "百敷や",
        "古き軒端の",
        "しのぶにも",
        "なほあまりある",
        "昔なりけり",
      ],
      author: "順徳院",
    },
  },
];

const hyakuninIsshuFeeder = new WeightedItemFeeder(...data);
